---
type: ImageView
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ImageView

`Autodesk.Revit.DB.ImageView` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2020 | `public static ImageView Create ( Document document , ImageTypeOptions options )` |
| Method | Print | — | `` |
| Property | ImageInstanceId | — | `public ElementId ImageInstanceId { get ; }` |
| Property | Parameter | — | `` |